app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
SELECT "movies".* FROM "movies"  ORDER BY "movies"."title" ASC
SELECT "movies".* FROM "movies"  ORDER BY "movies"."release_date" ASC
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13', 'PG')  ORDER BY "movies"."release_date" ASC
---
    def index
      @movies = Movie.all
      @ratings = Movie.get_ratings
      @ratings_checks = @ratings
      # Store sort key in session

      # Sort base on title or release date
      if session[:sort] == 'movie_title'
        @movies = @movies.order(:title)
      elsif session[:sort] == 'release_date'
        @movies = @movies.order(:release_date)
      end



      if session.key?(:ratings)
        @ratings_checks = session[:ratings]
        @movies = @movies.where(rating: @ratings_checks)